TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/гкс_ПриемкаТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ПриемкаТранспорта</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВремяНахожденияТСНаПЛК/гкс_ВремяНахожденияТСНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВремяНахожденияТСНаПЛК</name>
  <resources>
    <name>ВремяВзвешенБрутто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВзвешенТара</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОтклонение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отклонение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНаПЛК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/Forms/ФормаПричиныОтклоненияНормПогрузки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ДатаНачала") И Параметры.Свойство("ДатаОкончания") Тогда		
		ДатаНачала = Параметры.ДатаНачала;
		ДатаОкончания = Параметры.ДатаОкончания;
	Иначе
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса);
		ДатаОкончания = КонецДня(ТекущаяДатаСеанса);
	КонецЕсли;
		
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = ОрганизацияПЛК();	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыВремяНахожденияТСНаПЛК

&НаКлиенте
Процедура ВремяНахожденияТСНаПЛКВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВремяНахожденияТСНаПЛК.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ВремяНахожденияТСНаПЛКДокументРегистрации" Тогда 
		ПоказатьЗначение(, ТекущиеДанные.ДокументРегистрации);
	ИначеЕсли Поле.Имя = "ВремяНахожденияТСНаПЛКНоменклатура" Тогда	
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);
	ИначеЕсли Поле.Имя = "ВремяНахожденияТСНаПЛКТС" Тогда	
		ПоказатьЗначение(, ТекущиеДанные.ТС);
	ИначеЕсли Поле.Имя = "ВремяНахожденияТСНаПЛКПричинаОтклонения" Тогда

		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ДокументРегистрации", ТекущиеДанные.ДокументРегистрации);
		ПараметрыОткрытия.Вставить("ЭтоВызовИзФормыПричиныОтклоненияНормПогрузки", Истина);
		
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПричинаОтклоненияПогрузкиЗавершение", ЭтотОбъект);
		
		ОткрытьФорму("Обработка.гкс_ПриемкаТранспорта.Форма.ФормаОтклонениеНормПогрузки", ПараметрыОткрытия,,,,, 
			ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыВремяНахожденияТСНаПЛК 

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаполнитьВремяНахожденияТС(Команда)
	
	Если Не ВозможноЗаполнитьВремяНахожденияТС() Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьВремяНахожденияТСНаСервере();
		
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОрганизацияПЛК()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияНаПЛК.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.гкс_ВремяНахожденияТСНаПЛК КАК ВремяНахожденияТСНаПЛК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВремяНахожденияТСНаПЛК.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|ГДЕ
	|	ВремяНахожденияТСНаПЛК.ВремяВзвешенБрутто МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВремяНахожденияТСНаПЛК.ЕстьОтклонение
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияНаПЛК.Организация";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ДанныеЗапроса = Запрос.Выполнить().Выгрузить();
	Если ДанныеЗапроса.Количество() = 1 Тогда
		Возврат ДанныеЗапроса[0].Организация;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПричинаОтклоненияПогрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	                          
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ПричинаОтклонения") <> Неопределено Тогда
		
		ТекущиеДанные = Элементы.ВремяНахожденияТСНаПЛК.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.ПричинаОтклонения = Результат.ПричинаОтклонения;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВозможноЗаполнитьВремяНахожденияТС()
	
	ВозможноЗаполнитьВремяНахожденияТС = Истина;
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ВозможноЗаполнитьВремяНахожденияТС = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Незаполнен период.'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ВозможноЗаполнитьВремяНахожденияТС = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Незаполнена организация.'"));
	КонецЕсли;
	
	Возврат ВозможноЗаполнитьВремяНахожденияТС;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВремяНахожденияТСНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяНахожденияТСНаПЛК.ДокументРегистрации КАК ДокументРегистрации,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТС,
	|	ВремяНахожденияТСНаПЛК.ВремяВзвешенБрутто КАК ВремяВзвешенБрутто,
	|	ВремяНахожденияТСНаПЛК.ВремяВзвешенТара КАК ВремяВзвешенТара,
	|	ВремяНахожденияТСНаПЛК.Отклонение КАК Отклонение,
	|	ВремяНахожденияТСНаПЛК.Комментарий КАК ПричинаОтклонения,
	|	РегистрацияНаПЛК.Организация КАК Организация,
	|	ВремяНахожденияТСНаПЛК.ВремяНаПЛК КАК ВремяНаПЛК
	|ИЗ
	|	РегистрСведений.гкс_ВремяНахожденияТСНаПЛК КАК ВремяНахожденияТСНаПЛК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВремяНахожденияТСНаПЛК.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|ГДЕ
	|	РегистрацияНаПЛК.Организация = &Организация
	|	И ВремяНахожденияТСНаПЛК.ВремяВзвешенБрутто МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВремяНахожденияТСНаПЛК.ЕстьОтклонение";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ВремяНахожденияТСНаПЛК.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
